In [10]:
#Improt the database
import pandas as pd
import sqlite3
df = pd.read_csv('WA_Fn-UseC_-HR-Employee-Attrition.csv')
conn = sqlite3.connect('mydb.db')
df.to_sql('Employees', conn, if_exists='replace', index=False)

1470

Q1 Python/ Sqlite

In [ ]:
# count the length by python 
total_employees = len(df)
print(f"Total employees: {total_employees}")

Total employees: 1470

In [12]:
# count the length by SQL
s1= pd.read_sql_query("select count (*) FROM Employees;",conn)
s1

   count (*)
0       1470

In [ ]:
# count the employee by department (Python)
department_counts = df.groupby('Department').size()
print("Employee count by Department:")
print(department_counts)

Employee count by Department:
Department
Human Resources            63
Research & Development    961
Sales                     446
dtype: int64

In [14]:
# count the employee by department (SQL)
s2 = pd.read_sql_query("SELECT Department, COUNT(EmployeeNumber) AS " \
"employee_count FROM Employees GROUP BY Department;",conn)
s2

               Department  employee_count
0         Human Resources              63
1  Research & Development             961
2                   Sales             446